---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPathType.StartExtension
source: html/4d0fa7e4-92cd-4469-ba57-bf180e8f7a1d.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType.StartExtension Property

The start extension length of the stairs path.

## Syntax (C#)
```csharp
public double StartExtension { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for startExtension must be between 0 and 30000 feet.